КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ПЛ_Титул6/КонтурЛогистика_ПЛ_Титул6.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ПЛ_Титул6</name>
  <posting>Deny</posting>
  <attributes>
    <name>УИД_ПЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>Титул1</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1</types>
    </type>
  </attributes>
  <attributes>
    <name>Титул5</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул5</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>будет отображаться только в диадоке, не попадет в ЭтРН</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатИнфМО</name>
    <comment>Дата формирования файла обмена информации о результате предсменного, предрейсового медицинского осмотра</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрИнфМО</name>
    <comment>Время формирования файла обмена информации о результате предсменного, предрейсового медицинского осмотра</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатФайлИнфЗаезд</name>
    <comment>Дата формирования файла обмена Т5</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрФайлИнфЗаезд</name>
    <comment>Время формирования файла обмена Т5</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдФайлИнфЗаезд</name>
    <comment>Идентификатор файла обмена Т5</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭПЗаезд</name>
    <comment>Электронная подпись файла обмена информации о показаниях одометра при заезде транспортного средства на парковку (парковочное место)/при сдаче транспортного средства другому водителю</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМОПослесменный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПодпис</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыПодписи</types>
    </type>
  </attributes>
  <attributes>
    <name>СпосПодтПолном</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СпособыПодтвержденияПолномочий</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказаВПодписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОтказВПодписи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МедРаботник</name>
    <comment>Заполняется, если медицинский работник состоит в штате юридического лица или индивидуального предпринимателя, осуществляющего деятельность по перевозке пассажиров и багажа, грузов</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатВрПрМО</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>МедЛицензия</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_Лицензии</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеПолучателиФайла</name>
    <attributes>
      <name>ОрганизацияДиадок</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_СтатусыТитулов/КонтурЛогистика_СтатусыТитулов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_СтатусыТитулов</name>
  <comment>Время по МСК!</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыТитулов</types>
    </type>
  </resources>
  <resources>
    <name>СтатусПодписи</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыПодписи</types>
    </type>
  </resources>
  <resources>
    <name>ТипОшибки</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыОшибокСтатусаТитула</types>
    </type>
  </resources>
  <resources>
    <name>КодОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоОшибок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь1С</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодробноеОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулГП</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул2_5_02</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулГО</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ДФ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЭкспедиторскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул5</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул5_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул7</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул4_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул6</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул5</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул8</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул3_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_СкладскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулПВ</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул6</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипыЛогистическихДокументов/КонтурЛогистика_ТипыЛогистическихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыЛогистическихДокументов</name>
  <enumValues>
    <name>ТрН_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул4</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул5</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул6</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул7</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул8</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул4</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул3</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул4</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул5</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул6</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул7</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул8</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул9</name>
  </enumValues>
  <enumValues>
    <name>ЗЗ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ЗЗ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул4</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул5</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул6</name>
  </enumValues>
  <enumValues>
    <name>ДФ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ДФ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ЭкспедиторскаяРасписка</name>
  </enumValues>
  <enumValues>
    <name>СкладскаяРасписка</name>
  </enumValues>
  <enumValues>
    <name>ПЭ_ЗаявкаНаМаршрут</name>
  </enumValues>
  <enumValues>
    <name>ПЭ_Титул1</name>
    <comment>Поручение экспедитору (ПЭ). Титул1 (ON_POREXPKLT)</comment>
  </enumValues>
  <enumValues>
    <name>ПЭ_Титул2</name>
    <comment>Поручение экспедитору (ПЭ). Титул2 (подтверждение)</comment>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул1_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул2_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул3_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул4_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул5_5_02</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_КаналыТранспорта/КонтурЛогистика_КаналыТранспорта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_КаналыТранспорта</name>
  <comment>Диадок, API сервиса логистики, другие каналы</comment>
  <enumValues>
    <name>Диадок</name>
  </enumValues>
  <enumValues>
    <name>API_КонтурЛогистика</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СтатусыТитулов/КонтурЛогистика_СтатусыТитулов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СтатусыТитулов</name>
  <comment>Это статусы доставки в Диадок. Логистические статусы смотри в спр. КонтурЛогистика_СостоянияДвиженияДокументооборота</comment>
  <enumValues>
    <name>Пропущен</name>
  </enumValues>
  <enumValues>
    <name>Удален</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>ПодготовленКОтправке</name>
  </enumValues>
  <enumValues>
    <name>СформированыФайлыОбмена</name>
  </enumValues>
  <enumValues>
    <name>Подписан</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершенаРаспечатан</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершенаОтказВПодписи</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершена</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
    <comment>для титулов, которые были загружены из Диадока</comment>
  </enumValues>
  <enumValues>
    <name>ПолученТребуетОбработки</name>
  </enumValues>
  <enumValues>
    <name>ПолученОбработанСПредупреждением</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ПЛ_Титул6/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Подключаемый модуль (ПМ)
	ПараметрыПМ = Новый Структура("ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения", ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("ПЛ_Титул6_ПередЗаписью_После", Истина, ПараметрыПМ);
	Отказ = ?(Отказ <> ПараметрыПМ.Отказ, ПараметрыПМ.Отказ, Отказ);	// Если признак отказа был изменен в ПМ, то пробрасываем его значение
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьЧерновикДляНовогоДокумента(Ссылка);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ДокументОснование")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ДокументОснование) Тогда
		
		// TODO
		//ЗаполнитьПоДокОснованию(ДанныеЗаполнения);
		//ЗаполнитьРеквизитыПоПользователю();
		
	ИначеЕсли ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ПредыдущийТитул")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ПредыдущийТитул) Тогда
		
		ЗаполнитьПоПредыдущемуТитулу(ДанныеЗаполнения);
		ЗаполнитьРеквизитыПоПользователю();
		КонтурЛогистика_ОбработкаДокументовСервер.ДополнитьДополнительныхПолучателейИзГлавногоДокумента(ЭтотОбъект, Титул1);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.КонтурЛогистика_ФайлыОбмена") Тогда
		
		ФайлСсылка = ДанныеЗаполнения;
		ТекстФайла = ФайлСсылка.ТекстXML.Получить();
		Если СокрЛП(ТекстФайла) = "" Тогда 
			Сообщить("По файлу " + ФайлСсылка + " нет текста титула");
			Возврат;
		КонецЕсли;

		ЗаполнитьИзФайлаОбмена(ТекстФайла, ФайлСсылка);

	КонецЕсли;
	
	ЗаполнитьЗначенияПоУмолчанию();
	
	// ПМ на изменение документа
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
		"ПЛ_Титул6_ОбработкаЗаполнения_После",
		Истина,
		ЭтотОбъект);
		
КонецПроцедуры

Процедура ЗаполнитьЗначенияПоУмолчанию()
	
	Если Не ЗначениеЗаполнено(МедЛицензия) Тогда
		
		МедЛицензияПоУмолчанию = КонтурЛогистика_СтдОбщегоНазначения.ЗначениеРеквизитаОбъектаЛок(
			Титул1, "ЛицоОформившееПЛ.МедЛицензияПоУмолчанию");
		Если ЗначениеЗаполнено(МедЛицензияПоУмолчанию) Тогда
			МедЛицензия = МедЛицензияПоУмолчанию;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьИзФайлаОбмена(Знач ТекстФайла, Знач ФайлСсылка)
	
	НайденныйДокументТ1 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиГлавныйДокументПоФайлуПЛ(ФайлСсылка);
	
	Если Не ЗначениеЗаполнено(НайденныйДокументТ1) Тогда 
		
		Сообщить("При создании титула по файлу " + ФайлСсылка + "не смог найти исходный документ Титул1 путевого листа, создание не выполнено");
		
	Иначе
		
		Титул1 = НайденныйДокументТ1;
		XDTO = КонтурЛогистика_КонструкторыXDTO.ПолучитьXDTOпоXML(ТекстФайла);
		
		Если Найти(XDTO.ИдФайл, "DP_UVUTOCH") = 0 И Найти(XDTO.ИдФайл, "DP_UNISOOBSCH") = 0 Тогда 
			
			ЗаполнитьРеквизитыТитулаИзXDTO(XDTO);
			
		Иначе
			
			ЗаполнитьРеквизитыТитулаИзXDTOОтказ(XDTO);
			
		КонецЕсли;
		
		// Комментарий - нет в формате минтранса // TODO есть в Диадоке - научиться доставать из ДД 
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьРеквизитыТитулаИзXDTO(Знач XDTO)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Документ 		= КС.XDTO_Вычислить(XDTO, "Документ");
	СодИнфМО 	= КС.XDTO_Вычислить(XDTO, "Документ.СодИнфМО");
	
	УИД_ПЛ 		= КС.XDTO_Вычислить(СодИнфМО, "УИД_ПЛ");
	
	ДатИнфМО 	= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(Документ, "ДатИнфМО"));
	ВрИнфМО 	= КС.Конвертировать_ВремяТип_вДата(КС.XDTO_Вычислить(Документ, "ВрИнфМО"));
	
	ДатФайлИнфЗаезд = КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(Документ, "ИдИнфЗаезд.ДатФайлИнфЗаезд"));
	ВрФайлИнфЗаезд 	= КС.Конвертировать_ВремяТип_вДата(КС.XDTO_Вычислить(Документ, "ИдИнфЗаезд.ВрФайлИнфЗаезд"));
	ИдФайлИнфЗаезд 	= КС.XDTO_Вычислить(Документ, "ИдИнфЗаезд.ИдФайлИнфЗаезд");
	
	ЭПЗаезд = КС.XDTO_Вычислить(Документ, "ИдИнфЗаезд.ЭП");
	
	ТипПодпис_raw = КС.XDTO_Вычислить(Документ, "ПодпИнфМО.ТипПодпис");
	ТипПодпис = Перечисления.КонтурЛогистика_ТипыПодписи.ЗначениеИзXDTO(ТипПодпис_raw);
	
	СпосПодтПолном_raw = КС.XDTO_Вычислить(Документ, "ПодпИнфМО.СпосПодтПолном");
	СпосПодтПолном = Перечисления.КонтурЛогистика_СпособыПодтвержденияПолномочий.ЗначениеИзXDTO(СпосПодтПолном_raw);
	
	Должность 	= КС.XDTO_Вычислить(Документ, "ПодпИнфМО.Должн");
	Фамилия 	= КС.XDTO_Вычислить(Документ, "ПодпИнфМО.ФИО.Фамилия");
	Имя 		= КС.XDTO_Вычислить(Документ, "ПодпИнфМО.ФИО.Имя");
	Отчество 	= КС.XDTO_Вычислить(Документ, "ПодпИнфМО.ФИО.Отчество");
	
	ВидМОПослесменный = ?(КС.XDTO_Вычислить(СодИнфМО," ВидМО") = "1", Истина, Ложь);
	
	ДатВрПрМО_raw    = КС.XDTO_Вычислить(СодИнфМО, "СвМОПосл.ДатВрПрМО");
	ДатВрПрМО        = КС.Конвертировать_ДатаВремяВЗТип_вДатаВремяСеанса(ДатВрПрМО_raw);
	
	СвВодит_XDTO	= КС.XDTO_Вычислить(СодИнфМО, "СвМОПосл.СвВодит");
	Водитель 		= КС.Конвертировать_СвВодит_вВодителяЛогистикаМедосмотра(СвВодит_XDTO, Титул1);
	
	МедРаботник_XDTO = КС.XDTO_Вычислить(СодИнфМО, "СвМедРаб");
	МедОрганизация_XDTO = КС.XDTO_Вычислить(СодИнфМО, "СвМедОрг");  // по факту там такая же моделька как МедРаботник_XDTO только еще есть тег НаимМедОрг
	
	Если МедОрганизация_XDTO <> Неопределено Тогда 
		МедРаботник	    = КС.Конвертировать_СвМедРабИЛИСвМедОрг_вМедработника(МедОрганизация_XDTO);
		МедЛицензия_XDTO  = КС.XDTO_Вычислить(МедОрганизация_XDTO, "ЛицензМО");
	Иначе
		МедРаботник	    = КС.Конвертировать_СвМедРабИЛИСвМедОрг_вМедработника(МедРаботник_XDTO);
		МедЛицензия_XDTO  = КС.XDTO_Вычислить(МедРаботник_XDTO, "ЛицензМО");
	КонецЕсли;
	
	МедЛицензия = КС.Конвертировать_ЛицензМОТип_вЛицензия(МедЛицензия_XDTO, МедРаботник);
	
	КС.ЗаполнитьДополнительныхПолучателей(XDTO, ЭтотОбъект);

КонецПроцедуры

Процедура ЗаполнитьРеквизитыТитулаИзXDTOОтказ(Знач XDTO)
	
	ЕстьОтказВПодписи = Истина;
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Документ = КС.XDTO_Вычислить(XDTO, "Документ");
	
	Если Найти(XDTO.ИдФайл, "DP_UVUTOCH") > 0 Тогда
	
		// Данные Подписанта
		XDTO_Подписант 		= КС.XDTO_Вычислить(Документ, "Подписант");
		
		Должность 	= КС.XDTO_Вычислить(XDTO_Подписант, "Должн");
		Фамилия 	= КС.XDTO_Вычислить(XDTO_Подписант, "ФИО.Фамилия");
		Имя 		= КС.XDTO_Вычислить(XDTO_Подписант, "ФИО.Имя");
		Отчество 	= КС.XDTO_Вычислить(XDTO_Подписант, "ФИО.Отчество");
			
		ТекстУведомления 		= КонтурЛогистика_КонструкторыXDTO.XDTO_Вычислить(XDTO, "Документ.СвУведУточ.ТекстУведУточ");	
		ПричинаОтказаВПодписи 	= ?(Не ТипЗнч(ТекстУведомления) = Тип("ОбъектXDTO"), ТекстУведомления, ""); 
		
	Иначе // УС
		
		КС.ЗаполнитьРеквизитыТитулаИзУС(Документ, ПричинаОтказаВПодписи);
				
	КонецЕСли; 
	
КонецПроцедуры

Процедура ЗаполнитьПоПредыдущемуТитулу(Знач ДанныеЗаполнения)
	
	ПредыдущийТитул = ДанныеЗаполнения.ПредыдущийТитул;
	
	УИД_ПЛ 	= ПредыдущийТитул.УИД_ПЛ;
	Если ТипЗнч(ПредыдущийТитул) = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул1") Тогда 
		Титул1 	= ПредыдущийТитул;
	Иначе
		Титул1 	= ПредыдущийТитул.Титул1;
	КонецЕсли;
	
	КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
		Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6);
	
	// поиск документа учетной системы
	Если ЗначениеЗаполнено(КонтекстНастройкиКонвертации.ТипДокумента1С) Тогда
		
		НайденныйДокУчСист = КонтурЛогистика_ОбработкаДокументовСервер.НайтиДокументУчетнойСистемыПоТипуЛогистика(Титул1, Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6);
		
		Если ЗначениеЗаполнено(НайденныйДокУчСист) Тогда 
			ДокументОснование = НайденныйДокУчСист;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("Водитель") И ЗначениеЗаполнено(ДанныеЗаполнения.Водитель) Тогда 
		Водитель = ДанныеЗаполнения.Водитель;
	Иначе
		Водитель = Титул1.Водитель;
	КонецЕсли;
	
	Титул5 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5, Титул1);
	
	ЗаполнитьУказателиНаПредыдущийТитул(Титул5);
	
	ЗаполнитьЧерезНастройкиКонвертации(КонтекстНастройкиКонвертации);
	
	// Данные из рабочего места
	Если ДанныеЗаполнения.Свойство("МедРаботник") И ЗначениеЗаполнено(ДанныеЗаполнения.МедРаботник) Тогда
		МедРаботник = ДанныеЗаполнения.МедРаботник;
	КонецЕсли;
	Если ДанныеЗаполнения.Свойство("МедЛицензия") И ЗначениеЗаполнено(ДанныеЗаполнения.МедЛицензия) Тогда
		МедЛицензия = ДанныеЗаполнения.МедЛицензия;
	КонецЕсли;
	Если ДанныеЗаполнения.Свойство("Должность") И ЗначениеЗаполнено(ДанныеЗаполнения.Должность) Тогда
		Должность = ДанныеЗаполнения.Должность;
	КонецЕсли;
	Если ДанныеЗаполнения.Свойство("ДатВрПрМО") И ЗначениеЗаполнено(ДанныеЗаполнения.ДатВрПрМО) Тогда
		ДатВрПрМО = ДанныеЗаполнения.ДатВрПрМО;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатВрПрМО) Тогда
		ДатВрПрМО = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МедРаботник)
		И Не ЗначениеЗаполнено(МедЛицензия)
		И ЗначениеЗаполнено(МедРаботник.МедЛицензия) Тогда
		
		МедЛицензия = МедРаботник.МедЛицензия;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьУказателиНаПредыдущийТитул(Знач ПредыдущийТитул) Экспорт
	
	Перем ДвоичныеДанныеПодписи, ФайлТитула1;
	
	ФайлТитула1 = Справочники.КонтурЛогистика_ФайлыОбмена.КрайнийФайлДокумента(ПредыдущийТитул);
	
	Если Не ЗначениеЗаполнено(ФайлТитула1) Тогда 
		ВызватьИсключение "Не найден файл обмена Титулом1 Путевого листа - невозможно создать Титул6: " + ПредыдущийТитул;
	КонецЕсли;
	
	ИдФайлИнфЗаезд 	= СтрЗаменить(ФайлТитула1.ИмяФайла, ".xml", "");
	ДатФайлИнфЗаезд 	= ПредыдущийТитул.ДатИнфЗаезд;
	ВрФайлИнфЗаезд  	= ПредыдущийТитул.ВрИнфЗаезд;
	
	ДвоичныеДанныеПодписи = ФайлТитула1.Подпись.Получить();
	ЭПЗаезд 				= Base64Строка(ДвоичныеДанныеПодписи);

КонецПроцедуры

Процедура ЗаполнитьРеквизитыПоПользователю() Экспорт
	
	Попытка
		
		// Поиск подписанта в настройках подписания по дополнительному параметру.
		Если Не ЗначениеЗаполнено(ПользовательПодписант) И ЗначениеЗаполнено(ПараметрНастроекПодписания) Тогда
			ОрганизацияПодписанта = ?(ЗначениеЗаполнено(Титул1.ОрганизацияМедик), Титул1.ОрганизацияМедик, Титул1.ЛицоОформившееПЛ);
			
			ДанныеПодписанта = РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
				ОрганизацияПодписанта,,, ЭтотОбъект, ПараметрНастроекПодписания);
			
			ПользовательПодписант = ДанныеПодписанта.Пользователь1С;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПользовательПодписант) Тогда 
			ПользовательПодписант = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		
		// TODO дефолты, зависящие от Пользователя
		
	Исключение
		
		КонтурЛогистика_Метрика.ОбработатьОшибку("ЗаполнитьРеквизитыПоПользователю", ОписаниеОшибки());

	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьЧерезНастройкиКонвертации(КонтекстНастройкиКонвертации = Неопределено) Экспорт
	
	Если КонтекстНастройкиКонвертации = Неопределено Тогда
		КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
			Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6);
	КонецЕсли;
	
	Если КонтекстНастройкиКонвертации.ЕстьКонвертация Тогда
		КонтурЛогистика_ОбработкаДокументовСервер.ЗаполнитьДокументТитулПоДокументуУчетнойСистемы(
			ЭтотОбъект, КонтекстНастройкиКонвертации);
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьФайлОбмена(ПараметрыФайлаРеквизиты = Неопределено) Экспорт

	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("МассивФайловОбмена", Новый Массив);
	Результат.Успешно = Истина;
	
	Попытка
	
		Заблокировать();
	
	Исключение
		
		Результат.Успешно = Ложь;
	    Результат.ОписаниеОшибки = "Не удалось заблокировать документ: " + ОписаниеОшибки();
		Возврат Результат;
		
	КонецПопытки;
	
	// Проверка статуса после наложения блокировки на Документ
	РезультатПроверкиСтатуса = КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьТекущийСтатусДокументаДляСозданияФайловОбмена(Ссылка);
	
	Если НЕ РезультатПроверкиСтатуса.Успешно Тогда
		Разблокировать();
		Возврат РезультатПроверкиСтатуса;
	КонецЕсли;
	
	// Выполнить валидацию документа
	РезультатВалидации = Документы.КонтурЛогистика_ПЛ_Титул6.ПроверитьДокумент(Ссылка);
	
	Если РезультатВалидации.КоличествоОшибок > 0 Тогда
		
		Разблокировать();
		Результат.ОписаниеОшибки = "Ошибки в " + Ссылка + "! Исправьте их для отправки.";
		Результат.Успешно = Ложь;
		Возврат Результат;
		
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		ДатИнфМО = ТекущаяДатаСеанса();
		ВрИнфМО = ТекущаяДатаСеанса();
		
		// формируем текст xml
		Если Не ЕстьОтказВПодписи Тогда 
			РезультатФормированияТекста = СформироватьТекстФайла(ДатИнфМО, ВрИнфМО);
		Иначе
			Если КонтурЛогистика_ИнтеграцияДиадокСерверПовтИсп.ПереходНаУССостоялся(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6) Тогда
				РезультатФормированияТекста = СформироватьТекстФайлаУниверсальногоСообщения();
				ПараметрыФайлаРеквизиты.Вставить("ТребуетсяПодпись", Ложь);
				ПараметрыФайлаРеквизиты.Вставить("КаналТранспорта", Перечисления.КонтурЛогистика_КаналыТранспорта.Диадок);
			Иначе
				РезультатФормированияТекста = СформироватьТекстФайлаУведомленияОбУточнении(ДатИнфМО, ВрИнфМО);
			КонецЕсли; 			
		КонецЕсли;
		
		Если РезультатФормированияТекста.Успешно = Ложь Тогда
					
			Результат.Успешно = Ложь;
			Результат.МассивОшибок.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(РезультатФормированияТекста));
			Возврат Результат;
					
		КонецЕсли;
		
		// запишем в справочник
		РезультатСозданияФайла = Справочники.КонтурЛогистика_ФайлыОбмена.СоздатьФайлОбмена(
										РезультатФормированияТекста,
										Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6,
										ПараметрыФайлаРеквизиты,
										Ссылка);
				
		ЗаполнитьЗначенияСвойств(Результат, РезультатСозданияФайла);
		
		Если Результат.Успешно Тогда
			
			РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьСтатус(Ссылка, 
				Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена, , Истина);
			
			Результат.МассивФайловОбмена.Добавить(РезультатСозданияФайла.Файл);
			
		Иначе
			
			ВызватьИсключение КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(Результат);
			
		КонецЕсли;
		
		Записать(); // запишем  ДатИнфМО и ВрИнфМО
		
		Разблокировать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Разблокировать();
		Результат.Успешно = Ложь;
		Результат.Массивошибок.Добавить("Ошибка при формировании файла обмена по документу " + Ссылка + ": " + ОписаниеОшибки());
		
		КонтекстМетода = Новый Структура;
		КонтекстМетода.Вставить("ПараметрыФайлаРеквизиты", ПараметрыФайлаРеквизиты);
		КонтекстМетода.Вставить("РезультатСозданияФайла", РезультатСозданияФайла);
		
		КонтурЛогистика_Метрика.ОбработатьОшибкуФормированияТекстаФайла(Ссылка, ИнформацияОбОшибке(), КонтекстМетода);
		
	КонецПопытки;
	
	Возврат Результат;
		
		
КонецФункции 

Функция СформироватьТекстФайла(ДатаФормирования, ВремяФормирования)
	
	НомерТитула = 6;
	Формат = "5.01";
	ТипДокументооборота = "__PL";
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("ТекстФайла", "");
	
	XDTO_Файл = КС.XDTO_ФайлОбмена(НомерТитула, Формат, ТипДокументооборота);
	
	GUID = Строка(Новый УникальныйИдентификатор);
	
	Если ДополнительныеПолучателиФайла.Количество() > 0 Тогда 
		W = 1;
	Иначе
		W = 0;
	КонецЕсли;
	
	КС.ДобавитьДополнительныхПолучателейФайла(XDTO_Файл, ДополнительныеПолучателиФайла); 	
	
	XDTO_Файл.ИдФайл = КС.ИдентификаторФайлаТитулаПЛ(НомерТитула, 
												Титул1.ЛицоОформившееПЛ,
												Титул1.ОрганизацияМедик,
												Титул1.ОрганизацияТехСостояние,
												Титул1.ОрганизацияОдометр,
												GUID,
												W); 
	Результат.Вставить("ИдФайл",		XDTO_Файл.ИдФайл);
	
	ОрганизацияПодписанта = ?(ЗначениеЗаполнено(Титул1.ОрганизацияМедик), Титул1.ОрганизацияМедик, Титул1.ЛицоОформившееПЛ);
	ПодписантСтруктура 	= РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
		ОрганизацияПодписанта, ПользовательПодписант, Неопределено, ЭтотОбъект, ПараметрНастроекПодписания);
	
	XDTO_Подписант 		= КС.XDTO_ПодпИнф(НомерТитула, ТипДокументооборота, Формат, ПодписантСтруктура);
	Если ЗначениеЗаполнено(ПодписантСтруктура.МЧД) И ПодписантСтруктура.СпосПодтПолном = "3" Тогда 
		Результат.Вставить("ИдентификаторМЧД",	ПодписантСтруктура.МЧД);
	КонецЕсли;
	
	XDTO_Файл.Документ	= КС.XDTO_Документ(НомерТитула, ТипДокументооборота, Формат, XDTO_Подписант, ДатаФормирования, ВремяФормирования);
	
	XDTO_СодИнфМО = КС.XDTO_ПЛ_СодИнфМО(НомерТитула, Формат, Ссылка);
	КС.XDTO_Установить(XDTO_Файл.Документ, "СодИнфМО", XDTO_СодИнфМО);
	
	XDTO_ИдИнфЗаезд 	= КС.XDTO_ПЛ_ИдИнфЗаезд(НомерТитула, Формат, Ссылка);
	КС.XDTO_Установить(XDTO_Файл.Документ, "ИдИнфЗаезд", XDTO_ИдИнфЗаезд);
	
	ТекстФайла = КонтурЛогистика_КонструкторыXDTO.ПодготовитьТекстФайлаЛогистика(XDTO_Файл);
	
	Результат.Вставить("ТекстФайла",ТекстФайла);
	Результат.Вставить("GUID",		GUID);
	
	Результат.Успешно = Истина;
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьТекстФайлаУведомленияОбУточнении(ДатаФормирования, ВремяФормирования)
	
	НомерТитула = 6;
	Формат = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ФорматОбменаУведомленийОбУточнении();
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("ТекстФайла", "");

	XDTO_Файл = КС.XDTO_ФайлОбменаУведомлений(Ссылка, Титул1, Формат);
	
	// подписант
	ПодписантСтруктура 	= РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
							?(ЗначениеЗаполнено(Титул1.ОрганизацияМедик), Титул1.ОрганизацияМедик, Титул1.ЛицоОформившееПЛ),
							ПользовательПодписант,
							Неопределено,
							ЭтотОбъект,
							ПараметрНастроекПодписания);
							
	XDTO_Подписант 		= КС.XDTO_ПодписантУведомления( , , ПодписантСтруктура, Неопределено);
	XDTO_Файл.Документ.Подписант = XDTO_Подписант;
	Результат.Вставить("ИдентификаторМЧД",	ПодписантСтруктура.МЧД);
	
	GUID = Строка(Новый УникальныйИдентификатор);
			
	XDTO_Файл.ИдФайл = КС.ИдентификаторФайлаУведомлений(Титул1.ЛицоОформившееПЛ, ?(ЗначениеЗаполнено(Титул1.ОрганизацияМедик), Титул1.ОрганизацияМедик, Титул1.ЛицоОформившееПЛ), GUID); 
	Результат.Вставить("ИдФайл",		XDTO_Файл.ИдФайл);
																	
	КС.УдалитьПустыеСвойстваXDTO(XDTO_Файл);
													
	ТекстФайла = КонтурЛогистика_КонструкторыXDTO.ПодготовитьТекстФайлаЛогистика(XDTO_Файл, Формат);
	
	Результат.Вставить("ТекстФайла",ТекстФайла);
	Результат.Вставить("GUID",		GUID);
	
	Результат.Успешно = Истина;
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьТекстФайлаУниверсальногоСообщения()
	
	ЛицоОтпрУС = ?(ЗначениеЗаполнено(Титул1.ОрганизацияМедик), Титул1.ОрганизацияМедик, Титул1.ЛицоОформившееПЛ);
	ЛицоПолучУС = Титул1.ЛицоОформившееПЛ;
	ТекстУС = ПричинаОтказаВПодписи;
	ИмяПолФайл = ИдФайлИнфЗаезд;
	
	Результат = КонтурЛогистика_КонструкторыXDTO.СформироватьТекстФайлаУниверсальногоСообщения(ЛицоОтпрУС, ЛицоПолучУС, ТекстУС, ИмяПолФайл);
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли
